package com.icodejava.research.nlp.domain;

public enum NepaliPartsOfSpeech {
	
	  ADJECTIVE( "JJ" , "क्रिबि" , "क्रिया विशेषण" ),
	  ADJECTIVE_COMPARATIVE( "JJR" , "" , "" ),
	  ADJECTIVE_SUPERLATIVE( "JJS" , "" , "" ),
	  ADVERB( "RB" , "" , "" ),
	  ADVERB_COMPARATIVE( "RBR" , "" , "" ),
	  ADVERB_SUPERLATIVE( "RBS" , "" , "" ),
	  ADVERB_WH( "WRB" , "" , "" ),
	  CONJUNCTION_COORDINATING( "CC" , "" , "" ), //ra, tara --> Samyojak
	  CONJUNCTION_SUBORDINATING( "IN" , "" , "" ),
	  CARDINAL_NUMBER( "CD" , "" , "" ),
	  DETERMINER( "DT" , "" , "" ),
	  DETERMINER_WH( "WDT" , "" , "" ),
	  EXISTENTIAL_THERE( "EX" , "" , "" ),
	  FOREIGN_WORD( "FW" , "विदे" , "बिदेशी" ),
	  LIST_ITEM_MARKER( "LS" , "" , "" ),
	  NOUN( "NN" , "" , "" ),
	  NOUN_PLURAL( "NNS" , "" , "" ),
	  NOUN_PROPER_SINGULAR( "NNP" , "" , "" ),
	  NOUN_PROPER_PLURAL( "NNPS" , "" , "" ),
	  PREDETERMINER( "PDT" , "" , "" ),
	  POSSESSIVE_ENDING( "POS" , "" , "" ),
	  PRONOUN_PERSONAL( "PRP" , "" , "" ),
	  PRONOUN_POSSESSIVE( "PRP$" , "" , "" ),
	  PRONOUN_POSSESSIVE_WH( "WP$" , "" , "" ),
	  PRONOUN_WH( "WP" , "" , "" ),
	  PARTICLE( "RP" , "" , "" ),
	  SYMBOL( "SYM" , "" , "" ),
	  TO( "TO" , "" , "" ),
	  INTERJECTION( "UH" , "" , "" ),
	  VERB( "VB" , "क्रि" , "क्रिया" ), //सकर्मक, अकर्मक, प्रेरनार्थक
	  VERB_PAST_TENSE( "VBD" , "" , "" ),
	  VERB_PARTICIPLE_PRESENT( "VBG" , "" , "" ),
	  VERB_PARTICIPLE_PAST( "VBN" , "" , "" ),
	  VERB_SINGULAR_PRESENT_NONTHIRD_PERSON( "VBP" , "" , "" ),
	  VERB_SINGULAR_PRESENT_THIRD_PERSON( "VBZ" , "" , "" ),
	  VERB_MODAL( "MD" , "" , "" ), //can may must etc.
	  SENTENCE_TERMINATOR( "।", "पुबि" , "पूर्णविराम" ),
	  SENTENCE_TERMINATOR_QUESTION_MARK("?","",""),
	  SENTENCE_TERMINATOR_EXCLAMATION_MARK("!","","");	
	  

	  private final String tag;

	  private NepaliPartsOfSpeech( String tag, String nepaliName, String nepaliTag ) {
	    this.tag = tag;
	  }

	  public String toString() {
	    return getTag();
	  }

	  public String getTag() {
	    return this.tag;
	  }

	  public static NepaliPartsOfSpeech get( String value ) {
	    for( NepaliPartsOfSpeech v : values() ) {
	      if( value.equals( v.getTag() ) ) {
	        return v;
	      }
	    }

	    throw new IllegalArgumentException( "Unknown part of speech: '" + value + "'." );
	  }
	  
	  /*
	   कार्यका आधारमा शब्दको वर्गीकरण


कार्यका आधारमा शब्दको वर्गीकरण
नामः दृष्य वा अदृष्य बस्तु, व्यक्ति वा कुनै चिजको संज्ञा दिने शब्दलाई नाम भनिन्छ । परम्पारगत नेपाली व्याकरण अनुसार नाम पाँच प्रकारका रहेको पाइन्छ ।
१.       व्यक्तिवाचक नामः कुनै एक वा विशेष व्यक्ति, वस्तु, ठाउँ, दिन, पर्व आदिको नाम बुझाउने शब्दलाई व्यक्तिवाचक नाम भनिन्छ; जस्तै - राम, सीता, काठमाण्डौँ, तिहार, सोमवार, ल्होसार आदि ।
२.       जातिवाचक नामः एक जातका एक वा अनेकलाई बुझाउने शब्दलाई जातिवाचक नाम भनिन्छ; जस्तै - आमा, चरा, गाई, बाघ, विद्यालय, नारी, परेवा, पर्व आदि ।
३.       द्रव्यवाचक नामः नापतौल गर्न सकिने तर गन्न नसकिने पदार्थलाई बुझाउने शब्दलाई द्रव्यबाचक नाम भनिन्छ; जस्तै - चामल, घिउ, सुन, हिरा, पित्तल, पानी, दूध, काठ, दाल, बरफ, माटो, हावा, हिउँ आदि ।
४.       समूहवाचक नामः कुनै व्यक्ति, वस्तु वा जातिको समूह बुझाउने शब्दलाई समूहवाचक नाम भनिन्छ; जस्तै - बथान, बिटो, जन्ती, सङ्घ, दल, झुप्पो, फौज, पल्टन, ताँती, वर्ग, डफ्फा, समूह आदि ।
५.       भाववाचक नामः देख्न, तौलन, देख्न, सुन्न, सुघ्न, छाम्न र चाख्न नसकिने तर मनले भने अनुभव वा महसुस गर्न सकिने चिज बुझाउने शब्दलाई भाववाचक नाम भनिन्छ; जस्तै - दया, माया, विश्वास, नोकरी, चाकरी, वेदना, व्यथा, सत्कार, सतित्व, शिष्टता, हिँडाइ, बोलाइ, लेखाइ, सम्यता, मातृत्व, भाग्य, विद्या, निद्रा, घृणा, कलह, मिठास, नम्रता, बुढ्याइँ, सौन्दर्य, लोभ, कठोरता, सजावट, पक्राउ, हरण आदि ।

साङखेय आधारमा नामलाई गणनीय र अगणनीय गरी विभाजन गर्न सकिन्छ ।
१.       गणनीय नामः गन्ती गर्न सकिने तथा बहुवचनमा रूप परिवर्तन हुने नामहरु गणनीय नाम हनः जस्तै - माछो, आमा, किताब, रूख, मान्छे, चरो, आदि ।
२.       अगणनीय नामः गन्ती गर्न नसकिने तथा बहुवचन रुप नहुने नामहरूलाई अगणनीय नाम भनिन्छः जस्तै - चामल, तेल, शिक्षा, मोटाइ, शूरता, वीरता, सुन, चाँदी, कपडा आदि ।

जिवत्वका आधारमा नामलाई सजीव र निर्जीव गरी वर्गीकरण गर्न सकिन्छ ।
१.       सजीव नामः स्त्री वा पुरुषको बोध गराउने नामलाई सजिव नाम भनिन्छः जस्तै - गाई, बिरालो, भाउजू, माइजु  हरि, सिंह, राम, कृष्ण, गीता, सीता आदि ।
२.       निर्जीव नामः स्त्री वा पुरुषको बोध नगराउने नामलाई निर्जीव नाम भनिन्छः जस्तै - नीलगिरी, काठ, रूख, पानी, तेल, सुन, चाँदी, शिक्षा, मोटाइ, माटो आदि ।

मानवीय र मानवेतर नामः
१.       मानवीय नामः मानव जातिलाई जनाउने नामलाई मानवीय नाम भनिन्छ । मानवीय नामको क्रियामा लिङ्गभेदक हुन्छः जस्तै - भाइ गयो / बहिनी गई, हरि बस्छ / ललिता बस्छे; मानवीय नामसँग आउने सङ्ख्यावाचक शब्दमा 'जना' लाग्दछः जस्तै - एकजना मान्छे आए, तीनजना वकिल आए, सातजना डाक्टर आए; मानवीय नाम कर्म छ भने त्यसमा 'लाई' लाग्दछः जस्तै - मैले उसलाई भेटेँ, सीताले गीतालाई देखी, हरिले कृष्णलाई बोलायो आदि ।
२.       मानवेत्तर नामः मानव जातिलाई जनाउने बाहेकका नामलाई मानवेत्तर नाम भनिन्छ । मानवेत्तर नामको क्रियामा लिङ्गभेदक हुदैनः जस्तै - राँगो आयो / भैसी आयो, गोरु बस्यो / गाई बस्यो; मानवेत्तर नामको सङ्ख्यावाचक शब्दमा 'वटा' लाग्दछः जस्तै - पाँचवटा गाई, दशवटा गोरु, पन्ध्रवटा बाख्रा; मानवेत्तर नाम कर्म छ भने त्यसमा 'लाई' लाग्दैनः जस्तै - मैले भैसी भेटेँ, उसले कुखुरा काट्यो, हरिले कुकुर बोलायो आदि



सर्वनामः नेपाली व्याकरणमा नामको सट्टामा आउने पदलाई सर्वनाम भनिन्छ भनि व्याख्या गरिएको पाइन्छ तर नाम पद, नाम पदावली वा नाममूलक वाक्यका सट्टामा पनि सर्वनामको प्रयोग भएको पाइन्छ, सर्वनामले मूलतः पुरुष बताउँदछः जस्तै - राम विद्यार्थीहो । ऊ मिहेनतसाथ पढ्छ; राम र श्याम बजार गए । उनीहरू घर फर्कर्का छैनन्; तिमी ज्यादै मूर्ख रहेछौ । यो सुनेर श्याम जङ्गियो आदि ।
सर्वनामको वर्गीकरणः
१.       पुरुषवाचक सर्वनामः
क.      प्रथम पुरुषवाचकः म, हामी ।
ख.     द्वितीय पुरुषवाचकः तँ, तिमी, तपाइँ, हजुर, तिमीहरु, तपाइँहरू, हजुरहरू ।
ग.      तृतीय पुरुषवाचकः यो, यिनी, तिनी, ऊ, उनी, उहाँ, यिनीहरू, तिनिहरू, उनीहरू, यी, ती, उहाँहरू ।
२.       निजवाचक सर्वनामः आफू, आफूहरू, आफैँ आदि
३.       निश्चयवाचक/दर्शक सर्वनामः
क.      समीपवर्तीः यो, यी, यिनी, यिनीहरू ।
ख.     दूरवर्तीः त्यो, ऊ, ती, उनी, उनीहरू, तिनिहरू ।
४.       प्रश्नवाचक सर्वनामः को, के, कुन आदि ।
५.       सम्बन्धवाचक सर्वनामः जो, जसले, जे, त्यो, जुन, जहाँ आदि
६.       अनिश्चयवाचक सर्वनामः कोही, कुनै, जेसुकै, केही आदि ।

विशेषणः नाम वा सर्वनामको विशेषता बोध गराउने शब्द नै विशेषण हो । यसे नाम वा विशेषणको गुण, दोष, आकार, प्रकार, परिमाण, मात्रा, तौलजस्ता विशेषता जनाउदछः जस्तै - पाँच, यति, छोटो, पूर्वी, माथिल्लो, पाल्पाली आदि ।
विशेषणको वर्गीकरणः
१.       गुणबोधक विशेषणः चुच्चे, भित्री, नयाँ, पुरानो, बहिरो, रातो, धमिलो, नौलो, मीठो, छोटो, दुब्लो, मिजासिलो, होचो, गुलियो, पिरो, धनी आदि ।
२.       परिमाणबोधक विशेषणः सबै, अलिकति, धेरै, आधा, यति, उति, जति, ज्यादा, आदि ।
३.       सङ्ख्याबोधक विशेषणः एक, दुई, तीन, पहिला, दोस्रा, तेस्रा, करोडौँ, दुईगुना, लाखौँ आदि ।
४.       सार्वनामिक विशेषणः यो, त्यो, कुन, के, जे, यस्तो, त्यस्तो आदि ।
५.       भेदक विशेषणः नाम, सर्वनाम वा अव्यय शब्दमा को/का/की/रो/रा/री/नो/ना/नी जस्ता षष्ठी विभक्ति लागेर बनेको विशेषणलाई भेदक विशेषण भनिन्छः जस्तै - रामको, अगाडिको, आजको आदि ।




क्रियाः कुनै कार्य, स्थिति, घटना र अवस्था जनाउने शब्दलाई क्रिया भनिन्छः जस्तै - गर्छ, उदायो, पढ्यो, बस्नेछ, हिँड्छ, लेख्छ आदि । क्रिया वाक्यगठनका निम्ति आधारभूत तत्व भएकाले क्रिया बिनाको वाक्यले अर्थ स्पष्ट पार्न सक्दैन ।
क्रियाको वर्गीकरणः
१.       समापकताको आधारमाः
क.      समापिका क्रियाः वाक्यलाई टुङ्ग्याउने क्रियालाई समापिका क्रिया भनिन्छ । यसले कार्यको पूर्णताको भाव प्रकट गर्दछः जस्तै - खायौँ, लेखेछ, मानेछ, गर्छु, सुक्यो, झिक्ला आदि ।
ख.     असमापिका क्रियाः असमापिका क्रियाले कार्यको पुर्णताको भाव प्रकट गर्दैन । यसको प्रयोगले वाक्यको पूरा अर्थ व्यक्त हुँदैन, वाक्य टुङ्गिदैन । यस्ता क्रियाहरू धातुमा निम्नलिखित कृत् प्रत्यय लागेर निर्माण भएको पाइन्छः जस्तै - नुः खानु/जानु/पढ्नु/मान्नु आदि; नेः देख्ने/लेख्ने/जान्ने आदि; एकोः सिकेको/जानेको/गरेको/लेखेको आदि; तो/दो/तै/दैः हुँदो/देख्ता/लेख्दा/भन्दै/गर्दै/देख्दै आदि; ई/एरः गई/लेखी/पढी/गरेर/भनेर आदि; नः देख्न/भन्न/गर्न/पढ्न आदि ।
२.       शब्द ग्रहणशीलताका आधारमाः
क.      सकर्मक क्रियाः कर्मको अपेक्षा गर्ने क्रियालाई सकर्मक क्रिया भनिन्छ । यस्ता क्रियाको कार्य कर्ताले गर्दछ र फलको असर कर्ताबाहेकको अन्य पद वा कर्ममा पर्दछ । सकर्मक क्रियालाई के र कसलाई भनेर प्रश्न गर्दा उत्तर आउदछः जस्तै - राम पाठ पढ्छ । गोठालो गाई चराउँछ ।
ख.     अकर्मक क्रियाः कर्मको अपेक्षा नगर्ने क्रियालाई अकर्मक क्रिया भनिन्छ । यस्ता क्रियाको कार्य र फलको असर दुबै कर्तामा पर्दछः जस्तै - राम हाँस्यो, हावा चल्यो, रूख ढल्छ, खेलाडी दौडिन्छ, हरि हिँडछ आदि ।
ग.      द्विकर्मक क्रियाः दुईवटा कर्मलिने क्रियालाई द्विकर्मक क्रिया भनिन्छः जस्तै - भाइले बहिनीलाई कलम दियो । रमेशले सालीलाई चिठ्ठी लेखेछ । दाजुले छोरीलाई मिठाई किने ।
घ.      पूरकापेक्षी क्रियाः सामान्यतया क्रियाले वाक्यको अर्थ पूरा गर्दछ तर कहिलेकाहीँ आवश्यक आधारभूत कुराहरू आएर पनि क्रिया स्वयम्‌ले अर्थ पूरा गर्न नसकी पूरकको अपेक्षा गर्दछ भने त्यस्तो क्रियालाई पूरकापेक्षी क्रिया भनिन्छः जस्तै - राम (ठूलो) भयो । राम (टोलीनेता) छानिन्छ । राम (चतुर) छ । सबैले रामलाई (नेता) छाने ।
अर्थ पूरा गर्न पूरकको अपेक्षा गर्ने छ, हो, छानिन्छ, हुन्छ, छानेजस्ता क्रियाहरू पूरकापेक्षी क्रिया हुन् ।
३.       संरचनाका आधारमाः
क.      सरल क्रियाः एउटा धातुबाट बनेका क्रियालाई सरल क्रिया भनिन्छः जस्तै - गर, गरेँ, जाओस्, गयौँ, किन्छु, हाँस्यो आदि ।
ख.     जटिल क्रियाः एकभन्दा बढी धातुबाट बनेका क्रियाहरूलाई जटिल क्रिया भनिन्छ । जटिल क्रिया दुई प्रकारका हुन्छन् ।
अ.      संयुक्त क्रियाः मुख्य क्रिया र सहायक 'हु' क्रिया मिलेर बनेको क्रियालाई संयुक्त क्रिया भनिन्छः जस्तै - आउँछ होला, हेर्दै छौ, पढ्दी हौ, पढेको छ आदि ।
आ.    मिलित क्रियाः मुख्य क्रिया र 'हु' बाहेकका अन्य सहायक क्रिया मिलेर बनेका क्रियालाई मिलित क्रिया भनिन्छः जस्तै - गरिरहेको छ, पढ्दै गरेको थिइन्, किनेकै थिई होली आदि ।
४.       संरचनाका आधारमाः
क.      मुख्य क्रियाः दुई वा सोभन्दा बढी क्रिया मिलेर बनेको वाक्यमा अर्थको प्रधानता हुने क्रियालाई मुख्य क्रिया भनिन्छ । यो प्रायजसो सहायक क्रियाभन्दा अघि आउँछ । नेपाली भाषामा धेरैजसो क्रिया मुख्य क्रिया हुन सक्छन् ।
ख.     सहायक क्रियाः मुख्य क्रियाको कार्यमा सहयोगी हुने क्रियालाई सहायक क्रिया भनिन्छ । नेपालीमा छ र हुँ धातुबाट बनेका क्रियाहरूका साथै दि, लि, जा, उठ्, गर्, बन्, बस्, सक्, रह्, पर्, हेर्, लाउ, पाउ, आँट्, लाग्, चाह्, थाल् आदि धातुबाट बनेका क्रियाहरूले पनि सहायक क्रियाको कार्यसमेत गर्दछन् । जस्तै - 'गर्दै छ' मा 'गर्दै' मुख्य क्रिया हो भने 'छ' सहायक क्रिया हो । त्यस्तै 'भन्दै थिए' मा 'भन्दै' मुख्य क्रिया हो भने 'थिए' सहायक क्रिया हो । त्यस्तै 'लगाउँदै होली' मा 'लगाउँदै' मुख्य क्रिया हो भने 'होली' सहायक क्रिया हो ।
अव्ययः लिङ्ग, बचन र पुरुष आदि जस्ता व्याकरणात्मक एकाइका आधारमा नबदलिने अर्थात् सधै एकैनास रहेन शब्दलाई अब्यय भनिन्छः जस्तै - अगाडि, पछाडि, अनुसार, बमोजिम, चटक्क, धन्यवाद आदि । नेपाली व्याकरणमा अब्यय पाँच प्रकारका रहेको पाइन्छ ।
१.       नामयोगीः नाम, सर्वनाम र विशेषण वा नामिक पदसँग जोडिने बद्ध अब्यय पदलाई नामयोगी भनिन्छः जस्तै - सँगै, बिना, नेर, तिर आदि ।
२.       क्रियायोगीः क्रियापदसँग सम्बन्धित भई क्रियाको विशेषता बुझाउने अब्यय पदलाई क्रियायोगी भनिन्छः जस्तै - आज, भोलि, पर्सि, बिहान, अहिले, अस्ति, त्यहाँ, अगाडि, पूर्वपट्टि, अत्यन्त, अलिकति, बहुत, ज्यादै, राम्ररी, मस्तसँग, आदन्दले, फटाफट, सुटुक्क, प्वाक्क आदि ।
३.       संयोजकः शब्ब, उपवाक्य र वाक्यलाई जोड्न प्रयोग हुने शब्दलाई संयोजक भनिन्छ । नेपाली व्याकरणमा सापेक्ष र निरपेक्ष गरी दुई किसिमका संयोजकहरूको प्रयोग भएको पाइन्छ ।
क.      सापेक्ष संयोगकः एउटा मुख्य वाक्य र अर्को अधीन वाक्यलाई जोड्ने शब्दलाई सापेक्ष संयोजक भनिन्छः जस्तै - म आउँदिनँ भनी त्यो भन्दछ; भोलि छुट्टी छ भन्ने कुरा उसले भन्यो; मैले सुनेँ कि त्यो पढ्दैन; जान्छौ भने जाऊ; मा प्रयोग भएका क्रमशः भनी, भन्ने, कि, भने सापेक्ष संयोजक हुन् ।
ख.     निरपेक्ष संयोजकः एक अर्कामा स्वतन्त्र अस्तित्व बोकेका वाक्यहरूलाई जोड्ने संयोजकलाई निरपेक्ष संयोजक भनिन्छः जस्तै - गोपाल गए, गोविन्द पनि गए; मैले पाठ सुनाएँ, इनाम समेत पाएँ; तिमी जान्छ्यौ कि त्यो जान्छ?; मा क्रमशः पनि, समेत र कि निरपेक्ष संयोजक हुन् ।
४.       विस्मयादीबोधकः प्रायः वाक्यको अगाडि आई मानव मनका विभिन्न किसिमका मनोभाव (हर्ष, विस्मात, आश्चर्य, घृणा आदि) जनाउने शब्दहरूलाई विस्मयादिबोधक शब्द भनिन्छः जस्तै - ओहो, आम्मै, आहा, आत्था, धिक्कार, ए, स्यावास, ऐया आदि ।
५.       निपातः आफ्नै स्वतन्त्र अर्थ नभएका वाक्यको शुरु, मध्य वा अन्त्य कुनै पनि ठाउँमा आएर वाक्यलाई आकर्षक र मिठासपूर्ण बनाउने अब्यय पदलाई निपात भनिन्छ । वाक्यबाट निपाललाई झिकिदिँदा पनि वाक्यको अर्थमा कुनै पनि असर पर्दैनः जस्तै - छोराले त पैसा झिक्यो; भोलि मेरो घर आउन ल; कृष्णले त हो नि हामिलाई दुःख दिएको; होइन क्यारे, त्यस्तो पनि हुन्छ;  मा क्रमशः त, ल, त हो नि, क्यारे निपात हुन् ।




शब्द
भाषाको न्यूनतम अर्थयुक्त एकाइ रूपभन्दा माथिल्लो एकाइ नै शब्द हो जसमा एक वा एकभन्दा बढी रूपहरू रहन्छन् ।
स्रोतका आधारमा शब्दको वर्गीकरण
नेपाली भाषाको शब्दभण्डारमा विभिन्न स्रोतबाट विकसित भएका शब्दहरु रहेका छन् । मुख्य रुपमा नेपाली भाषामा प्रयोग हुने शब्दहरूलाई स्रोतका आधारमा मौलिक र आगन्तुक गरी दुई प्रकारमा विभाजन गर्न सकिन्छ ।
अ. मौलिक शब्दः
१.       तत्सम शब्दः संस्कृत भाषाका शब्दहरू रूप र अर्थमा परिवर्तन नभई नेपाली भाषामा आएका शब्दलाई तत्सम शब्द भनिन्छः जस्तै - सुख, फल, गुरु, ईश्वर, नारी, शिक्षा, स्त्री, वर्ष, निन्द्रा आदि ।
२.       तद्भव शब्दः संस्कृत भाषाका शब्दहरु रूप र अर्थमध्ये रूप परिवर्तन भए पनि अर्थमा परिवर्तन नभईकन नेपाली भाषामा प्रयोग भएका शब्दलाई तद्भव शब्द भनिन्छः जस्तै - अक्षिः आँखो, दुग्धः दूध, हस्तः हात, उज्ज्वलः उज्यालो, रक्तः रातो आदि।
३.       देशज शब्दः कुनै भाषाको प्रयोगको सन्द्रर्भमा त्यस भाषाको प्रकृति, अवस्था र वातावरण अनुकूल निर्माण भएका ठेट शब्दलाई देशज शब्द भनिन्छः जस्तै - कटक्क, हुरुक्क, तपतप, फटाफट आदि ।
आ. आगन्तुक शब्दः
४.       स्वदेशी आगन्तुकः नेपालभित्र बोलिने संस्कृत भाषाबाहेकका अन्य भाषाबाट नेपाली भाषामा आएका शब्दहरू स्वदेशी आगन्तुक शब्दहरू हुन् । स्वदेशी आगन्तुक शब्दअन्तर्गत मैथिली, भोजपुरी, ताजपुरी, थरुवानी, दनुवारी, चुरेटी, माझी, बोटे, दरै, अवधी, कुम्हाले, धिमाल, मेचे, वान्तवा, राई, लिम्बु, मगर, गुरुङ्ग, तामाङ्ग, नेवारी आदि भाषाबाट नेपाली भाषामा भित्रिएका शब्दहरू पर्दछन् जस्तै - मैथिलीबाट पैनी, गाछी, हाट, दाउनी आदि; मगरबाट सिकर्मी, पर्खाल, प्वाल, पसल, डकर्मी, चाकु, झ्याल, खापा, ढोका, छिंडी, चोलो, पटुका, जाँतो, दौरा, बाउसे, सुँगुर आदि; तामाङ्गबाट घ्याङ्ग, डम्फू, च्याङ्वा, लामा, सेलो आदि ।
५.       विदेशी आगन्तुकः नेपाल भन्दा बाहिर बोलिने संस्कृत भाषाबाहेकका अन्य भाषाबा६ नेपाली भाषामा भित्रिएका शब्दहरू विदेशी आगन्तुक शब्दअन्तर्गत पर्दछन् । विदेशी आगन्तुकअन्तर्गत विदेशमा बोलिने हिन्दी, बंगाली, अङ्ग्रेजी, फ्रेन्च, पुर्तगाली, रुसी, फारसी, तुर्की, अरबी, तेलगु, तमिल, मुन्डा, चिनियाँ, जापानी आदि भाषाबाट नेपाली भाषामा भित्रिएका शब्दहरू पर्दछन् जस्तै - हिन्दीबाट अन्धाधुन्ध, कमसेकम, जेलेवी आदि; अङ्ग्रेजीबाट ग्यारेज, पोस्टर, कोट, करेन्ट, इन्जिनियर आदि; फ्रेन्चबाट कर्फ्यू, कुपन, पुलिस, कार्टुन, कलेज आदि; पुर्तगालीबाट बोतल, पेस्तोल, साबुन, चिया आदि; फारसीबाट दस्तखत, उम्मेदवार, बच्चा, पिसाप, प्याज आदि; ग्रीकबाट थ्योरी, प्रोग्राम, थर्मस, थेसिस, फिलोसफी आदि; जर्मनीबाट सेमिनार, निकेल, किन्डरगार्डेन, फरेनहाइट आदि; ल्याटिनबाट अपरेटर, हजार, आम्दानी, आराम, चस्मा आदि; रुसीबाट भोड्का, रूबल, पेरेस्त्रोइका, सोभियत, जार आदि; तुर्कीबाट काका, चम्चा, नोकर, चक्कु, कुल्ली आदि; अरबीबाट असल, इलम, कसम, कानुन, किताब आदि; चिनियाँबाट चाउचाउ, चाउमिन, लिची, तुफान आदि; जापानीबाट जुडो, कँराते, होण्डा, सुजुकी, रिक्सा आदि; तेलगुबाट गुन्डा, चोक, डोली आदि; मलयालमबाट टोपी, पापड, लाठो, सर्वत आदि । ,,,
बनोटका आधारमा शब्दको वर्गीकरण
मूल शब्दः मूल शब्दलाई अब्युत्पन्न शब्द पनि भन्ने गरिन्छ । यो भाषाको तल्लो सार्थक एकाइ भएकाले यसलाई टुक्र्याउन सकिदैन । नेपाली भाषामा प्रयोगमा रहेका खर्च, कागत, नोकर, पहिचान, मनु, दीप, मन, धन, शरीर, कुमार, दान, दुई, घर, झिलिक, यो, काम, कबि, दिन, धूप, ऊ, मोटो, पिर्, टेक्, दि, रु, बस्, खेल्, कुट्, बोक्, फ्याक् आदि शब्दहरू मूल शब्दहरू हुन् ।
व्युत्पन्न शब्दः मूल शब्दमा उपसर्ग वा प्रत्यय लागी वा शब्दको पुनरावृत्तीबाट बनेका शब्दलाई व्युत्पन्न शब्द भनिन्छ । नेपाली भाषामा ४ प्रकारका व्युत्पन्न शब्दहरू पाइन्छन् ।
१.       उपसर्ग लागेर निर्मित शब्दहरूः अबशेष, अतिशय, उपग्रह, प्रतिलिपि आदि।
२.       प्रत्यय लागेर निर्मित शब्दहरूः बोलक्कड, घेराउ, देखावट, मननीय, मतियार, बठ्याइँ आदि ।
३.       समास भएर निर्मित शब्दहरूः गुरुदक्षिणा, चरिचुच्चे, भनाभन, रातमाटे भाषाविज्ञान आदि ।
४.       द्वित्व भएर निर्मित शब्दहरूः घरघर, जसलेजसले, जा-जा, आ-आफ्नो, ता-तातो, स-सानो, पानीसानी, भुटभाट, खोलखाल आदि ।






वर्णः कुनै भाषाको ध्वनि व्यवस्थामा पाइने लघुतम अर्थभेदक एकाइलाई वर्ण भनिन्छ । समान परिवेशमा आएर अर्थमा भिन्नता ल्याउने भाषाको लघुतम रूप नै वर्ण हो । भाषाको सबैभन्दा सानो एकाइ जसलाई टुक्र्याउन सकिदैन त्यो नै वर्ण हो ।

वर्णको वर्गीकरण 

स्वर/व्यञ्जन वर्ण
क.      नेपाली भाषामा प्रयोग हुने देवनागरी लिपिमा निम्नानुसारका स्वर वर्णहरू रहेको पाइन्छः अ, आ, इ, ई, उ, ऊ, ऋ, ए, ऐ, ओ, औ, अं, अः ।
ख.     नेपाली भाषामा प्रयोग हुने देवनागरी लिपिमा निम्नानुसारका व्यञ्जन वर्णहरू रहेको पाइन्छः क्, ख्, ग्, घ्, ङ्, च्, छ्, ज्, झ्, ञ्, ट्, ठ्, ड्, ढ्, ण्, त्, थ्, द्, ध्, न्, प्, फ्, ब्, भ्, म्, य्, र्, ल्, व्, स्, ष्, श्,  ह्, क्ष्, त्र्, ज्ञ् ।

कथ्य/लेख्य वर्ण

१.       कथ्य वर्णः ।
क.      कथ्य स्वर वर्णहरूः अ, आ, इ, उ, ए, ओ।
ख.     कथ्य व्यञ्जन वर्णहरूः क्, ख्, ग्, घ्, ङ्, च्, छ्, ज्, झ्, ट्, ठ्, ड्, ढ्, त्, थ्, द्, ध्, न्, प्, फ्, ब्, भ्, म्, य्, र्, ल्, व्, स्, ह् । 

२.       लेख्य वर्णः नेपाली भाषामा प्रयोग हुने देवनागरी लिपिमा निम्नानुसारका लेख्य वर्णहरू रहेको पाइन्छ ।
क.      लेख्य स्वर वर्णहरूः अ, आ, इ, ई, उ, ऊ, ऋ, ए, ऐ, ओ, औ, अं, अः ।
ख.     लेख्य व्यञ्जन वर्णहरूः क्, ख्, ग्, घ्, ङ्, च्, छ्, ज्, झ्, ञ्, ट्, ठ्, ड्, ढ्, ण्, त्, थ्, द्, ध्, न्, प्, फ्, ब्, भ्, म्, य्, र्, ल्, व्, स्, ष्, श्,  ह्, क्ष्, त्र्, ज्ञ् ।

खण्डीय/खण्डेत्तर वर्ण
१.       खण्डीय वर्णः स्वतन्त्र अस्तित्व भएका वर्णलाई खण्डीय वर्ण भनिन्छ । यस अन्तर्गत स्वर र व्यञ्जन वर्ण पर्दछन् ।
२.     खण्डेत्तर वर्णः स्वतन्त्र रूपमा प्रयोग नहुने तथा अलग्गै अर्थ नभई स्वर व्यञ्जनका पूरक वा विस्तारक भएर आउने मात्रा, आघात, अनुतान, अनुनासिकता, विरामजस्ता वर्णहरूलाई खण्डेत्तर वर्ण भनिन्छ ।





नेपाली भाषा
नेपाली भाषा नेपालको राष्ट्रभाषा र सम्पर्क भाषा तथा भारत, भुटान र बर्माको केही भागमा मातृभाषाको रूपमा बोलिने भाषा हो । यो भाषा आर्य-भारोपेली समूहमा पर्दछ । यो भाषा नेपाल र भारतको आधिकारिक (सरकारी काम काजको) भाषा हो । नेपालका करिब आधा जनसंख्याले आफ्नो मातृभाषाको रूपमा यो भाषा बोल्ने गर्दछन् । देवनागरी लिपिमा लेखिने यो भाषामा २ किसिमका वर्णहरू छन् । स्वरवर्णमा १२ र व्यञ्जनवर्णमा ३६ वटा वर्णहरू रहेका छन् ।
नेपाली भाषा विभिन्न समयमा विभिन्न नामले चिनिन्थ्यो । खस कुरा, पर्वते भाषा तथा गोर्खाली भाषा आदि। यी मध्ये खस कुरा सबैभन्दा पुरानो नाम हो। खस जातिहरूले बोल्ने भाषा भएको हुनाले यसलाई खस भाषा भनिएको हो । यो भाषा पश्चिम नेपालको कर्णाली क्षेत्रमा विकसित भएर पूर्वतर्फ फैलदै गएको हो । खस कुरा पश्चिम नेपालको मगर जातिहरूले बोल्ने भाषा खाम कुरा सँगै विकसित भएर अगाडि बढेको मानिन्छ ।

नेपाली भाषाका विशेषताहरू
१.       बायाँबाट दायाँतिर लेखिने ।
२.       स्वर तथा व्यञ्जन दुवै वर्णको प्रयोग भएको ।
३.       शब्दको माथि भागमा डिका दिएर लेखिने ।
४.       स्वर वर्णलाई मात्रा तथा अक्षर दुवै रूपमा प्रयोग गर्न सकिनेः जस्तै - आ/(क + आ) ‍= का, इ/(क + इ) ‍= कि आदि ।
५.       बहुरूपी वर्णहरूको प्रयोग भएकोः जस्तै - 'र' का विविध रुप, 'ण' का विविध रूप आदि ।
६.       बर्णात्मक लिपि भएको भाषा, एउटा चिन्हले एउटा वर्ण जनाउने ।
७.       कतिपय वर्णहरू हलन्त बोलिए पनि अजन्त लेखिनेः जस्तै - चाल, पाल, मान, माल आदि ।







	  

	  
	  शिरविन्दु र चन्द्रविन्दुको नियमहरू
	  शिरविन्दु प्रयोगका नियमहरू
	  १.       कहिलेकाहीँ डिकमाथि वर्ण छ भने चन्द्रविन्दुको ठाउँमा शिरविन्दु लेखेर पनि काम चलाउने गरे तापनि चन्द्रविन्दुकै प्रयोग गर्नु राम्रो हुनेछः जस्तै - औँला/औंला, चुलेँसी/चुलेंसी आदि ।
	  २.       तत्सम र तद्भव शब्दमा क्, च्, ट्, त्, प्, अघि शिरविन्दु दिएर क्रमशःङ्, ञ्, ण्, न्, म् को काम चलाइन्थ्यो तर यी शब्दमा भन् पञ्चम वर्णहरू नै लेख्नुपर्दछः जस्तै - शंका/शङ्का, लांछना/लाञ्छना, कंठ/कण्ठ आदि ।
	  ३.       य्, र्, ल्, व्, श्, ष्, ह् अघि आएको शिरविन्दुले पनि म् को अर्थ दिन्छः जस्तै - संयम (सम्यम्), संवत् (सम्वत्), संहार् (सम्हार) आदि तर यी वर्णको अघि शिरविन्दुको प्रयोग गर्नु उपयुक्त हुन्छ ।
	  ४.       नेपाली झर्रा शब्द र आगन्तुक शब्दमा शिरविन्दु प्रयोग हुँदैनः जस्तै - रम्घा, मान्छे, लडन्त, भिडन्त, चम्चा, सम्झना, सिन्की आदि ।
	  चन्द्रविन्द्र प्रयोगका नियमहरु
	  १.       नाके बोलीबाट उच्चाहरण हुने शब्दहरु खासगरी अ, आ, इ, उ आदि स्वर र ती मिलेका व्यञ्जनको टाउकामा चन्द्रविन्दु प्रयोग गरिन्छः जस्तै - अँजुली, अँध्यारो, आँखा, आँगन, काँस, बाँस, जाँच, साँचो, हाँस, नाउँ, जाँगर, भुँडी, दायाँ, वायाँ आदि ।
	  २.       क्रियाको प्रथम पुरुषको रूपमा पनि चन्द्रविन्दु प्रयोग गरिन्छः जस्तै - गएँ, लिएँ, जान्छौँ, गरूँला, छौँ, लेखेँ, लेख्थेँ आदि ।
	  ३.       उहाँ, जहाँ, त्यहाँ, आउँलाजस्ता अव्यय शब्दमा चन्द्रविन्दुको प्रयोग गरिन्छ ।
	  ४.       दुईवटा स्वरमा चन्द्रविन्दुको प्रयोग गरिन्छः जस्तै - गाउँछ, लगाउँथ्यो, देखाउँछन्, गराउँथी आदि ।
	  
	  
	  
	  
	  
	  हलन्त र अजन्तको प्रयोग
हल् भनेको व्यञ्जन वर्ण हो र अज् भनेको स्वर वर्ण हो । हलन्त शब्दको अन्त्यमा व्यञ्जन वर्ण हुन्छ । अजन्त शब्दको अन्त्यमा स्वर वर्ण हुन्छ । व्यञ्जन अन्त्यमा आउने शब्दको अन्तिम वर्णको खुट्टा काटिन्छ भने स्वर वर्ण अन्त्यमा आउने शब्दको अन्तिम वर्णको खुट्टा काटिदैन ।
हलन्तसम्बन्धी नियमहरू
१.       मान्, वान् प्रत्ययबाट निर्मित शब्दमा हलन्तको प्रयोग हुन्छः जस्तै - श्रीमान्, विद्वान् भगवान्, धनवान्, बुद्धिमान् आदि ।
२.       अन्त्यमा त्, द्, म् भएका तत्सम शब्दमा हलन्तको प्रयोग हुन्छः जस्तै - अकस्मात्, आपत्, कदाचित, भविष्यत्, चित्, जगत्, दण्डवत्, बृहत्, यावत्, विद्युत्, सभासद्, अहम्, आपद्-विपद्, संसद्, एवम्, स्वयम्, स्वागतम्, आदि ।
३.       अनुष्टुप्, पृथक्, महान्, सम्राट, षट् जस्ता तत्सम शब्दमा हलन्तको प्रयोग गरिन्छ ।
४.       द्वितीय पुरषवाचक अनादर एकवचन कर्ताको क्रियामा हलन्तको प्रयोग हुन्छः जस्तै - गर्, बस्, खाइस्, गइन्, हेरेस्, गएस्, जालास् आदि ।
५.       उस्, उफ्, कैयन्, क्याबात्, झन्, धत्, स्याबास्, इस्‌जस्ता अव्यय शब्दमा हलन्तको प्रयोग हुन्छ ।
६.       तृतीय पुरुषको बहुवचन क्रिया हलन्त लेखिन्छः जस्तै - जान्छन्, भन्नेछन्, गएछन् आदि ।
अजन्तसम्बन्धी नियमहरू
१.       नाम, सर्वनाम, विशेषण, अनुकरणात्मक शब्दहरू हलन्त उच्चाहरण भएपनि अजन्त लेखिन्छः जस्तै - कपाल, काट, दालभात (नाम), उस, त्यस, उन (सर्वनाम), उदेक, दस, इमान(विशेषण), गडबड, झलझल(अनुकरणात्मक) आदि ।
२.       एक अक्षरी शब्द अजन्त लेखिन्छः जस्तै - छ, त, तँ, न, म, र, ल, ह आदि ।
३.       केही संख्यावाचक शब्दहरु अजन्त लेखिन्छः जस्तै - छ, एघार, बाह्र, तेह्र, चौध आदि ।
४.       अब, जब, तब, पर, तल, नत्र, निर, बाहिर, सँग, सित, जान, आउन, बसेर, हेरेरजस्ता अव्यव शब्दमा अजन्त प्रयोग गरिन्छ ।
५.       पढ, लेख, डुल, सुनजस्ता द्वितीय पुरषका बहुवचनबोधक विध्यर्थ क्रियामा अजन्तको प्रयोग हुन्छ ।
६.       छ, जान्छ, हुनेछ, हुँदैन, हुने छैन, थिएन, गरेन, भेननजस्ता तृतीय पुरुषका एकवचन बुझाउने क्रियाको अनादर रूप अजन्त लेखिन्छ ।
७.       गर्न, खर्च, पर्ख, मर्द, हर्र, सर्रर, झ्वाम्म, झिक्न, फर्क, लाग्न, पन्ध्र, झुस्स झलमल, भिडन्तजस्ता संयुक्त वर्ण भएका शब्दमा अजन्तको प्रयोग गरिन्छ ।
८.       दनादन, दन्दनी, चसचसीजस्ता उही वर्ण दोहोरिएर निर्मित अनुकरणात्मक शब्द अजन्त लेखिन्छ ।



क्ष / छ को प्रयोग
'क्ष' को प्रयोग

१.       अक्ष, अक्षर, अध्यक्ष, परीक्षा, क्षण, क्षति, क्षमता, क्षमा, क्षितिज, क्षेत्र, क्षेप्यात्र, चक्षु, दक्ष, दिक्षा, नक्षत्र, परीक्षण, प्रत्यक्ष, भिक्षा, रक्षा, लक्षण, शिक्षण, शिक्षा, समक्ष, सर्वेक्षण, साक्षी, पक्ष, साक्षरजस्ता तत्सम शब्दहरुमा 'क्ष'  प्रयोग हुन्छ ।
'क्षे' को प्रयोग
१.       अक्षेता, क्षेत्र, क्षेत्रीय, क्षेप्यास्त्र, आक्षेप, सङ्क्षेपजस्ता तत्सम शब्दमा 'क्षे' को प्रयोग हुन्छ ।
'क्ष्य' को प्रयोग
परिप्रेक्ष्य, उपलक्ष्य, लक्ष्य, आरक्ष्यजस्ता तत्सम शब्दमा 'क्ष्य' को प्रयोग हुन्छ ।
'छ' को प्रयोग
१.       अभूतकालीन क्रियामा 'छ' को प्रयोग हुन्छः जस्तै - खान्छ, जानेछ, पढ्छ, पढ्नेछ आदि ।
२.       छर्, छाड्, छान्‌जस्ता धातुमा पनि 'छ' को प्रयोग हुन्छ ।
३.       छटाहा, छड्के, छनुवा, छपनी, छपाइजस्ता व्युत्पन्न शब्दमा 'छ' को प्रयोग गरिन्छ ।
४.       छक्क, छडी, छत्तीस, छपन्न, छर्रा, छट्नीजस्ता शब्दमा 'छ' को प्रयोग गरिन्छ ।
५.       छत्र, छटा, छन्द, छल, छाता, छिद्र, इच्छा, गुच्छ, तुच्छ, स्वच्छ आदिजस्ता तत्सम शब्दमा 'छ' को प्रयोग हुन्छ ।
'छे' को प्रयोग
१.       अभूतकालीन स्त्रीलिङ्गी क्रियामा 'छे' को प्रयोग हुन्छः जस्तै - जान्छे, खान्छे, देख्छे आदि ।
२.       छेक, छेत्री, छेपारो, छेलो, छेऊ, छेक्नु, छेस्किनी, बछेडोजस्ता शब्दमा 'छे' को प्रयोग गरिन्छ ।
'छ्य' को प्रयोग
१.       छ्या, छ्याके, छ्याङ्, छ्यापछ्याप्ती, छ्याप्नु, रछ्यान, छ्यूँ, विछ्यौनाजस्ता झर्रा नेपाली शब्दमा 'छ्य' को प्रयोग गरिन्छ ।





ऋ / रि / री को प्रयोग
'ऋ' को प्रयोग
१.       'ऋ' को प्रयोग केवल संस्कृतको तत्सम शब्दमा मात्र हुन्छः जस्तै - ऋषि, ऋचा, ऋतु, ऋण, ऋणी आदि ।
'रि' को प्रयोग
१.       कुरिलो, खेरि, रिखिडोरो, रिङ्गटा, रिङ्गाइ, रिजाल, वरिपरि, सुरिलो, पक्रिनु, फक्रिनु, सरियो, सिङ्ग्रिङजस्ता तद्भव शब्दमा 'रि' को प्रयोग हुन्छ ।
२.       रिजर्भ, रिजल्ट, रिटायर, रिपोर्ट, रिल, रिहर्सल, रिवाज, रिकापी, रिहा, रिहाइ, रिक्सा, सिफारिसजस्ता आगन्तुक शब्दमा पनि 'रि' प्रयोग गरिन्छ ।
'री' को प्रयोग
१.       बटारी, गरी, झारी, भकारी, मितेरी, मेरी, सत्तरी, सिङ्गौरी, हेरी, बिक्री, फिक्री, लम्री, सिक्री, झुम्रीजस्ता तद्भव शब्द र डायरी, सरी, सायरी, सायरीजस्ता आगन्तुक शब्दमा 'री' को प्रयोग गरिन्छ ।



ओ / व को प्रयोग
'ओ' को प्रयोग
१.       तत्सम शब्दमा 'ओ' प्रयोग हुने केही शब्दः जस्तै - ओखल, ओइरो, ओखती, ओछ्यान, ओझेल, ओठ, ओढार, ओदान, ओसिलो, ओढ्नु, ओरालो, ओर्लिनु, ओस, ओसारपसार, ओसार्नु, ओहोरदोहोर आदि ।
२.       आगन्तुक शब्दमा पनि 'ओ' को प्रयोग गरिन्छः जस्तै - ओभरलोड, ओहदा, ओट, ओत, ओभरसियर आदि ।
३.       कराओ, खाओ, जाओ, देओ, कराओस्, देओस्, जाओस्‌जस्ता क्रियापदमा पनि 'ओ' को प्रयोग गरिन्छ ।
'व' को प्रयोग
१.       थकावट, नरिवल, मिसावट, वटा, वरिपरि, वस्तीजस्ता तद्भव शब्द र टावर, पावर, वकिल, वकालत, वजन, वतनजस्ता आगन्तुक शब्दमा 'व' को प्रयोग हुन्छ ।





य / ए को प्रयोग
'य' को प्रयोग
१.       सर्वनाम र त्यसबाट निर्मित शब्दमा 'य' को प्रयोग हुन्छः जस्तै - यो, त्यो, यता, यति, यत्रो, त्यत्रो, त्यहाँ, त्यसरी, यतिञ्जेल आदि ।
२.       व्युत्पन्न शब्दको मध्य र अन्त्यमा 'य' को प्रयोग हुन्छः जस्तै - घुस्याहा, रत्यौली, मतियार, दुष्ट्याइँ, सहरिया, जहानियाँ, घरानियाँ आदि ।
३.       यज्ञ, विद्यालय, यमुना, एयर, टायल, डायरी, डायल, सजाय, कायल, गयल, गायबजस्ता आगन्तुक शब्दमा 'य' को प्रयोग हुन्छ ।
४.       पेय, हाँस्य, कार्य, रमणीय, कर्तव्य, दृष्य, वाक्य, जय, माधुर्य, पाण्डित्य वाणिज्य, सौन्दर्य, राष्ट्रिय, क्षेत्रीय, स्वर्गीय, स्वकीय, राजकीय, भवदीय, अमात्य, ग्राम्य, मूल्य, मुख्य, मनुष्य, दैत्य, जलमय, वाङ्मयजस्ता तत्सम शब्दमा 'य' को प्रयोग हुन्छ ।
५.       भूतकालीन सहायक क्रिया थियो, थियौँ, थियौ, आदि मा पनि 'य' को प्रयोग हुन्छ ।
६.       'ता' प्रत्यय अघि 'य' को प्रयोग  गरिन्छः जस्तै - रचयिता, मनुष्यता आदि ।
'ए' को प्रयोग
१.       खासगरी अङ्ग्रेजी स्रोतबाट भित्रिएका आगन्तुक नेपाली शब्दमा 'ए' को प्रयोग हुन्छः जस्तै - एजुकेसन, एक्स-रे, एजेण्डा, एजेन्सी, एभरेस्ट, एयरलाइन्स आदि ।
२.       संख्यावाचक शब्द र त्यसबाट निर्मित शब्दमा 'ए' को प्रयोग हुन्छः जस्तै - एक, एउटा, एक्काइस, एकतीस, एकहत्तर, एकानब्बे आदि ।
३.       सम्भावनार्थ, क्रियामा 'ए' को प्रयोग हुन्छः जस्तै - खाइएला, गइएला, भनिएला, पढिएला आदि ।
४.       एकता, एकत्व, एकादशी, एकत्र, एकाग्र, एकाङ्की, एकान्त, एवम्‌जस्ता तत्सम शब्दमा 'ए' को प्रयोग हुन्छ ।
५.       कृदन्त शब्दमा 'ए' को प्रयोग गरिन्छः जस्तै - गएर, खाएर, भएर, सुनिएर, लस्किएर, कुल्चिएर आदि ।
६.       भूतकाल बुझाउने प्रथम पुरुषको एकवचन र तृतीय पुरुषको बहुवचन सामान्य क्रियामा र द्वितीय पुरुषको विध्यर्थ क्रियामा 'ए' को प्रयोग गरिन्छः जस्तै - लाएँ, खाएँ, पठाएँ, लिएँ, गएँ, खाए, ल्याए, गाए, पाए, भए, दिएस्, रोएस्, खाएस्, धोएस्, गए आदि ।


	  
	  
	  ब् / व् को प्रयोग
'ब' को प्रयोग
१.       नेपाली भाषाका झर्रा शब्द र तद्भव शब्दमा 'ब' को प्रयोग गरिन्छः जस्तै - खाँबो, बखत, बक्सिस, बकुल्लो, बँदेल, बकपत्र, बङ्गारा, बगर, बथान, बादल, बन्धकी, बाडुली, बिगो, बीमा, बेत, देब्रे, अबिर, हिसाब, बर्को, बाजा, सबै,  बाटो, बाघ आदि ।
२.       क्रिया र कृदन्त शब्दमा 'ब' को प्रयोग हुन्छः जस्तै - बस्नु, बग्नु, बच्नु, बोल्नु, बाँझ्नु, बचत, बनोट आदि ।
३.       बि, बे, बद उपसर्ग लागेका शब्दमा 'ब' को प्रयोग गरिन्छः जस्तै - बिछोड, बिखर्च, बिजोग, बेकाम, बेकार, बदनाम, बेइज्जत आदि ।
४.       संयुक्त अक्षर लेख्ता पनि 'ब' को प्रयोग गरिन्छः जस्तै - शब्द, क्षुब्ध, शताब्दी, ब्यारेक, ब्याटरी, ब्याज आदि ।
५.        अब, तब, जब, बित्तिकै, बिस्तारै, बुरुक्क, बेर, बेसरीजस्ता अव्ययवाचक शब्दहरूमा पनि 'ब' को प्रयोग गरिन्छ ।
६.       बाधा, बुद्ध, बुद्धि, बोध, प्रतिबन्ध, बालक, बाला, बालिका, बन्धु, बाहु, बृहत्, स्तब्ध, ब्रह्मा, बाहुल्यजस्ता तत्सम शब्दमा पनि 'ब' को प्रयोग गरिन्छ ।
'व' को प्रयोग
१.       वकालत, वकिल, ह्वास्स, वारि, वाल्ल, ट्वाल्ल, छ्वाल्लजस्ता आगन्तुक र तद्भव शब्दमा पनि 'व' को प्रयोग हुन्छ ।
२.       'उवा', 'वाला', 'आवट' प्रत्यय लागी बनेका शब्दम पनि 'व' को प्रयोग हुन्छः जस्तै - चरुवा, खोसुवा, फुकुवा, फाँटवाला, हकवाला, घरवाला, खेतीवाला, ढिपीवाला, बोलावट, लेखावट, बनावट, सजावट आदि ।
३.       वि, वै र रेफ भएका तत्सम शब्दमा 'व' को प्रयोग गरिन्छः जस्तै - विकट, विघटन, विकर्षण, विफल, विकृत, विज्ञापन, विक्रम, विचार, विचित्र, विहीन, विजय, विज्ञान, विद्वान, विनिमय, विवाह, विशाल, वैज्ञानिक, वैरागी, वैशाख, वर्ग, वृद्धि, वर्ष, वर्ण, वार्षिक, वृतान्त आदि ।
४.       वर, तव्य, त्व, वत्, वान्, वती आदि प्रत्यय लागेर बनेका शब्दः जस्तै - ईश्वर, कर्तव्य, वक्तव्य, द्रष्टव्य, प्रभूत्व, नेतृत्व, मित्रवत्, पुत्रवत्, गुणवान्, धनवान्, बलवान्, भगवती, सौभाग्यवती, तपस्वी, तेजस्वी आदि ।
५.       मानव, दानव, राघव, पाण्डव, वासुदेव, सम्भव, संवाद, संवेग, संविधान, वंश, वचन, वर, वाचन, वेद, व्यञ्जन, व्यवस्था, व्याख्या, व्यापक, व्यायाम, व्रत आदि जस्ता तत्सम शब्दमा पनि 'व' को प्रयोग गरिन्छ ।



श/ष/स को प्रयोग
'श' को प्रयोग
१.       संस्कृत तत्सम शब्दमा प्रायजसो 'श' को प्रयोग गरिन्छः जस्तै - आक्रोश, गणेश, दिशा, श्लेष, श्लिष्ट, पाश्चात्य, पश्चिम, आश्चर्य, विश्वास, शाखा, स्पर्श, विमर्श, श्रुति, श्वास, शैक्षिक, शैली, शिशु, शिशिर, शीर्षक, शासन, शोषक, अशेष, विशेष, आश्वासन, शास्त्र, श्रोता, श्री, श्रृङ्खला, शक्ति, आशीर्वाद, श्लोक, निश्चय, श्रम, श्राप, विश्लेषण, संश्लेषण आदि ।
२.       विसर्ग (:)  चिन्हको प्रयोग भएको ठाँउमा 'श' को प्रयोग हुन्छः जस्तै - प्रायशः, शब्दशः, शतशः, अक्षरशः, क्रमशः आदि ।
३.       तद्भव र आगन्तुक शब्दमा 'श' को प्रयोग हुँदैन ।
'ष' को प्रयोग
१.       तत्सम शब्दमा ट, ठ, ड, ढ, ण, प को अगाडि 'ष' को प्रयोग हुन्छः जस्तै - अष्ट, ओष्ठ्य, कनिष्ठ, अनुष्ठान, घनिष्ट, पाषाण, षोडशी, आषाढ, दुष्ट, कष्ट, उष्ण, विशेषण, षष्ठी, वाष्प आदि ।
२.       तत्सम शब्दको 'क' को अगाडि 'ष' प्रयोग गरिन्छः जस्तै - मस्तिष्क, परिष्कार, पुष्कर, निष्काशन, निष्कर्ष आदि ।
३.       ईर्ष्या, कोष, ग्रीष्म, पौष, विषाद, निष्फल, भूषण, वर्षा आदि जस्ता केही तत्सम शब्दमा पनि 'ष' को प्रयोग हुन्छ ।
४.       तद्भव र आगन्तुक शब्दमा 'ष' को प्रयोग हुँदैन ।
'स' को प्रयोग
१.       सबै तद्भव शब्दमा 'स' को प्रयोग गरिन्छः जस्तै - सय, दस, सेतो, ससुरा, आँसु, पुस, सास, असोज, आकास, अस्ति, एक्कासि, पर्सि, सिमसिम आदि ।
२.       सबै आगन्तुक शब्दमा 'स' को प्रयोग गरिन्छः जस्तै - स्टेसन, रासन, सिकार, स्कुल, अफिसर, कोटेसन, सहर, बदमास, ब्रिटिस, सहिद आदि ।
३.       स, सत्, सम्, सु, स्वयं जोडिएका तत्सम शब्दको अगाडि 'स' प्रयोग गरिन्छः जस्तै - सकाम, सफल, सत्कार, सज्जन, सम्मान, संयुक्त, समीक्षा, सुकर्म, सूक्ति, स्वस्ति, स्वरूप, स्वयंवर आदि ।
४.       तत्सम शब्दको बीचमा 'स' को प्रयोग गरिन्छः जस्तै - आस्तिक, कुसुम, असीम, शासन, सरस्वती, पुरस्कार, उत्सुक आदि ।

	  
	  
	  
	  ह्रस्व र दीर्घसम्वन्धी सामान्य नियमहरू
पदादिमा ह्रस्वः
१.       झर्रा र तद्भव नेपाली शब्दमाः जस्तै - कुकुर, पुर्पुरो, कुनो, सुकुल, गुन, घिउ, हिउँ, सिन्की, सिन्को, गुन्द्रुक आदि ।
२.       नाताबोधक शब्दमाः जस्तै - बुबा, मुमा, भिनाजु, दिदी, मितिनी, जुवाइँ, जिबा, जिमा, फुपाजु, बुहारी, आदि ।
३.       उपसर्ग वा प्रत्यय लागेका व्युत्पन्न शब्दमाः जस्तै - विरोध, उपहार, नियम, सुयोग्य, कुकर्म, निर्माण, निस्तेज, दुर्गन्ध, बुढ्याइँ, धुपौरो, सिलौटो, पुजारी, पिराहा, नुनिलो, दुधालु, भित्रिया, ढुकुवा, आदि ।
४.       मूल वा व्युत्पन्न सर्वनाम शब्दमाः जस्तै - तिमी, उनी, उहाँ, तिनी, यिनी, कुन, जुन आदि ।
५.       संख्यावाचक शब्दः जस्तै - दुई, त्रिचालीस, त्रिपन्न, उन्नाइस, उनान्सय, दुना, तियाँ आदि ।
६.       आगन्तुक शब्दमाः जस्तै - इन्जिन, डिपो, डिलर, ग्लुकोज, बुट, इनाम, किताब, उस्ताद, मुचुल्का, इस्पात, मिसन, बिगुल, लिची आदि ।
७.       धातु वा क्रिया शब्दमाः जस्तै - दिनु, लिनु, सुन्नु, हुनु, उभिनु, चिम्लनु, चुहिनु, खुस्किनु, लिन्छ, हुन्छ, बिर्सिन्छ आदि ।
८.       व्युत्पन्न वा अव्युत्पन्न शब्दमाः जस्तै - उहिले, उही, भित्र, तिर, सित, हिजो, मुनि, कुन्नि, नि, लु, चिम्म, फुत्त आदि ।
पदमध्यमा ह्रस्व
१.       झर्रा तद्भव र देशज शब्दमाः जस्तै - कमिलो, आलुचा, पटुवा, खुकुरी, माइत, मानिस, मुन्धुम, मथिङ्गल, खड्कुलो, कनिका, थुचुक्क, टाकुरो, चुकुल, रसिया, हँसिया, खोरिया, गबुवा आदि ।
२.       नाताबोधक शब्दमाः जस्तै - भतिजा, भानिज, ससुरा, भाउजू, माइजू, भाइबुहारी, सम्धिनी, देउरानी, बहिनी आदि ।
३.       उपसर्ग र प्रत्यय लागी बनेका नाम र विशेषण शब्दमाः जस्तै - अनुमान, अतिरिक्त, अधिकार, अभिमान, परिचय, प्रतिशत, विनिमय, सदुपयोग, ररिलो, लिखित, मौखिक, भरिया, बटुवा, कसिङ्गर, जिताउरी आदि ।
४.       अव्यय शब्दमाः जस्तै - अघिल्तिर, मास्तिर, यतिन्जेल, अहिले, उहिले, लेखुन्जेल, जाउन्जेल आदि ।
५.       सम्पूर्ण कृदन्त र मिलित क्रियामाः जस्तै - उभिनु, झस्किनु, टल्किनु, भनिएको, गरिसकेको, लेखिँदा, गरिने, चलिरहनु, लिइन्छ, बसिदिन्छु, गइहाल्यो आदि ।
६.       सबै आगन्तुक शब्दमाः जस्तै - तरिका, नतिजा, हाजिर, हजुर, असुल, कानुन, फाइदा, चाउमिन, पाउडर, कमिज, टेलिफोन, कार्टुन आदि ।
७.       केही संख्यावाचक शब्दमाः जस्तै - उन्नाइस, एकाउन्न, बाउन्न, पहिलो, एउटा, दुइटा, दुगुना, बाइसौँ आदि ।

पदान्तमा ह्रस्व
१.       पुलिङ्गी नाम शब्दमाः जस्तै - दाजु, भाइ, नाति, पति, गुरु आदि ।
२.       कृदन्त नु, आइ, आउ र तदितान्त आइ, याइँ, गाँसिई बन्ने भाववाची नाम शब्दमाः जस्तै - पढ्नु, लेख्नु, सोचाइ, बोलाइ, घेराउ, पक्राउ, लमाइ, मोटाइ, चतुर्‍याइँ, मुर्ख्याइँ आदि ।
३.       स्थान जनाउने नाम शब्दमाः जस्तै - बालाजु, मलेखु, कपिलवस्तु, टेकु आदि
४.       नपुंशकलिङ्गी उकारान्त नाम शब्दमाः जस्तै - आलु, छानु, घिउ, हिउँ, केराउ, उखु, मासु आदि ।
५.       परिमाणबोधक विशेषण शब्दमाः जस्तै - यति, उति, त्यति, कति, जति आदि ।
६.       उकारान्त बिशेषण शब्दमाः जस्तै - दयालु, मयालु, घरेलु, सिकारु, सिपालु आदि ।
७.       मूल अव्यय शब्दमाः जस्तै - मुनि, माथि, भोलि, पर्सि, अघि, पछि, पनि, नि आदि ।
८.       सामान्य क्रियाको अन्तिम उकारः जस्तै - जान्छु, गाउँछु, खान्छु आदि ।
९.       देखि र निम्ति विभक्ति लागेका शब्दः जस्तै - मदेखि, तिम्रानिम्ति आदि ।
१०.   अन्तमा टि, ति, धि, नि, पि, वि,षि हुने तत्सम शब्दमाः जस्तै - सृष्टि, गति, शान्ति, नीति, विधि, मुनि, प्रतिनिधि, सन्धि, ग्लानि, रवि, छवि, लिपि, कवि, कृषि आदि ।
११.   प्रथम पुरुषवाची एकवचन बुझाउने वर्तमानकालीन क्रियामाः जस्तै - गर्छु, लेख्छु, पढ्छु, बोल्छु आदि ।

पदादिमा दीर्घ
१.       दुई अक्षरले बनेको नामको पछाडि रेफ लागेको छ भने अगाडिको ईकार/ऊकार दीर्घ हुन्छः जस्तै - पूर्ण, घुर्की, कीर्ना, मूर्ख आदि ।
२.       विशेषण शब्दमाः जस्तै - पूरा, ठूलो, तीतो, बूढो, मीठो, झीनो, ठीक, तीखो आदि ।
३.       संख्यावाचक शब्दमाः जस्तै - तीन, बीस, तीस आदि ।
४.       केही तत्सम (संस्कृत) शब्दमाः जस्तै - पीडा, दूध, शीर्षक, भूमि, ईश, चीत्कार, भीषण, मीन, शून्य, सुक्ष्म, क्षीण, रीति, नीति, प्रीति, कीर्ति, वीर, जीव, जून, ईश, दीन, हीन, मूल, शूल आदि ।

पदमध्यमा दीर्घ
१.       केही नाम शब्दमाः जस्तै - अछूत, कपूर, कन्दमूल, खजूर, जासूस, पनीर, बन्दूक, मरीच, सन्दूक आदि ।
२.       ईय, ईन, ईत आदि प्रत्यय लागेका शब्दमाः जस्तै - जातीय, सम्पादकीय, केन्द्रीय, आत्मीय, नवीन, कालीन, प्राचीन, कुलीन, अतीत, व्यतीत आदि ।
३.       संख्याबाचक शब्दमाः जस्तै - चौबीस, बत्तीस, छत्तीस, चालीस, बयालीस आदि ।
४.       विध्यर्थ क्रियामाः जस्तै - बसून्, गरून्, जाऊन् आदि ।

पदान्तमा दीर्घ
१.       स्त्रीलिङ्ग नाम शब्दमाः जस्तै - छोरी, साली, स्वास्नी, गाई, भैँसी आदि ।
२.       नपुंशक शब्दको अन्तिम इकारः जस्तै - पानी, थाली, ठेकी, थैली, टोपी, फर्सी आदि ।
३.       सर्वनाम शब्दमाः जस्तै - हामी, तिमी, ऊ, उनी, आफू, कोही, तपाइँ आदि ।
४.       ईकारान्त विशेषण शब्दमाः जस्तै - धनी, नोकरी, ज्ञानी, डाक्टरी, अल्छी, आँटी, गफाडी, नेपाली, काली आदि ।
५.       ऊकारान्त विशेषण शब्दमाः जस्तै - उल्लू, बुद्दू, लद्दू, पत्रू, चालू आदि ।
६.       संख्यावाचक विशेषण शब्दमाः जस्तै - दुई, साठी, सत्तरी, असी आदि ।
७.       विध्यर्थ जनाउने क्रियामाः जस्तै - खाऊ, सुन्नू, दिनू, सम्झनू, बसूँ आदि ।
८.       सर्वनामबाट निर्मित शब्दको पछाडि आउने 'ही' जस्तै - यही, उही, त्यही आदि ।
९.       'एर' अर्थ दिने र स्त्रीलिङ्गी क्रियाको अन्तिम ईकारः जस्तै - खाई (खाएर), पढी, आई, लेखी, बुझी आदि ।
१०.    की, री, नी विभक्ति चिन्ह लागेका शब्दः जस्तै - मेरी, तेरी, रामकी, उसकी आदि ।
११.    'लाई' विभक्ति लागेका शब्दः जस्तै - मलाई, रामलाई, उसलाई आदि ।
१२.    'अरी', 'तरी' प्रत्ययान्त र व्युत्पन्न अव्यय शब्दः जस्तै - यसरी, कस्तरी, त्यसरी, खलखली, तनतनी आदि ।
१३.    आदर, माया वा सम्बन्धबोधक स्त्रीलिङ्ग जनाउने शब्दः जस्तै - श्री, सुश्री, श्रीमती, जी, ज्यू, सानू, बाबू, उसकी, उसकी, आफ्नी, तिम्री, मेरी आदि ।
१४.    जात, थर, पेशा जनाउने शब्दमाः जस्तै - कामी, दमाई, क्षेत्री, रेग्मी, अधिकारी, पराजुली, भट्टराई, ज्यामी, व्यापारी, खेती आदि ।
१५.    स्थान र नदीको नामको अन्तिम ईकार दीर्घ हुन्छः जस्तै - नारायणी, सिन्धुली, सप्तरी, लालबन्दी, मेची, द्यौलागिरी आदि ।
ली, आली, एली, यौली, अनी, अन्ती, आउटी, आरी, एरी जस्ता प्रत्यय लागेका शब्दको अन्तिम ईकार दीर्घ हुन्छः जस्तै - भारतेली, पुर्ख्यौली, रत्यौली, उब्जनी, कटनी, घोकन्ती, छेराउटी, चिनारी, पोतेरी आदि ।
	  
	  
	  */
	  
	  
}
